{"podcast_details": {"podcast_title": "Babbage from The Economist", "episode_title": "Babbage: How to avoid a battery shortage", "episode_image": "https://assets.pippa.io/shows/62e286a934d4d9fe5e874247/1693331482559-fba24d359dca8a647e8d64eaf5bb7b96.jpeg", "episode_transcript": " Hey, I'm Ryan Reynolds. At Mint Mobile, we like to do the opposite of what Big Wireless does. They charge you a lot, we charge you a little. So naturally, when they announced they'd be raising their prices due to inflation, we decided to deflate our prices due to not hating you. That's right, we're cutting the price of Mint Unlimited from $30 a month to just $15 a month. Give it a try at mintmobile.com slash switch. New activation and upfront payment for three-month plan required, taxes and fees extra. Additional restrictions apply. Visit cmentmobile.com for full terms. This episode of Babbage is supported by IDA Ireland. With the highest share of STEM graduates per capita in the EU, IDA Ireland can help source the skills you need to internationalize and thrive. Visit idaisland.com to learn more. The Economist. A quick announcement before we get started with today's episode. Economist Podcast Plus, our new subscriber service is here. Whether you're one of the thousands of people who've signed up in the past weeks or you're a longtime subscriber, you'll need to link your podcast app to your Economist subscription to listen to everything we have on offer. We'll have more details on how to set up your account later in the show. If you're not yet a subscriber, don't panic. You've got until the end of October to get a half price offer. To sign up now, click the link in the show notes or search online for Economist podcasts. The world is going through one of the biggest transitions of energy in history. Many countries want renewables or other clean energy to power everything. If the transition goes well, the cities of the future should be greener, quieter and more electric. Cleaning up power stations that burn fossil fuels, of course, is a big part of the transformation. But as everyone knows, if you want to rely on solar, wind, wave or any other renewable source of energy to make more and more of the world's electricity, you'll need lots of new storage. Now there are lots of different types of storage, but today we want to focus on the one which is probably most important to you in everyday life, batteries. In the coming decades, if the green energy transition is going to work, we need more batteries that can store more energy with chemistries that are less reliant on rare metals. And of course, all of this new technology will somehow need to become a lot cheaper than it is today. So what new technologies are on the horizon? And most importantly, which ones actually stand a chance of becoming useful? This is Babbage from The Economist. I'm Alok Jha. Today, how to solve the world's energy storage problem. There are lots of ways to make a battery. Lead acid, nickel cadmium, alkaline, the list goes on and on. They're all used for different things, but for a long time, they all shared one thing in common. They were all very heavy. That meant they weren't very useful if you wanted to make anything electronic that was also mobile. A music player might be okay, but not much more. And forget using batteries to power cars. That was until lithium ion batteries appeared about 30 years ago. These were lighter than earlier generations of batteries and first appeared in expensive electronics like laptops. Then they got bigger and nowadays lithium ion batteries are driving the electric car revolution. The lithium ion battery has actually been around quite a long time. Paul Marchilli is The Economist's innovation editor and he's been watching the world of batteries evolve for some time. But when it became important was Sony in particular in the early 90s managed to commercialize it. I mean, up to that time, we had lead acid batteries, but they're really big heavy. You can't really put a lead acid battery in a computer. That's the type that's in a typical car nowadays, a fossil fuel car. Yeah. We still use lead acid batteries to start cars. Nickel cadmium batteries are around for a while and they were quite good, but they were fairly bulky and not terribly reliable and they had a memory effect and they could suddenly just stop working and your device was dead. Lithium ion batteries were lighter, much more efficient, lasted a long time and have steadily over the years got better and better. And then finally, bigger versions of these batteries were made and it's really those batteries that have enabled the renaissance in electric cars. And it is a renaissance. I mean, electric cars were around at the beginning of all the automobile and Henry Ford's wife famously drove an electric car. But you know, they use big old heavy batteries. So lithium ion has sort of enabled the sort of mobile electric age that we live in now. And it's the battery that everyone talks about for the future as well, because it's light, it's portable, it's got great charge density, all that good stuff. But of course, they're not perfect, are they? Indeed, they're not perfect. I mean, lithium is a very reactive material. And if something goes wrong in a lithium ion cell, there's a chemical reaction and it causes an intense fire, which is very hard to put out. And so that's one problem you've got. The other is they're still fairly limited. You know, people would like their phones to last longer on a charge and they'd like to be able to drive their electric cars much further without having to stop to recharge them. Another problem, of course, is that lithium is a fairly rare material in the sense that it's quite expensive to mine. There's only a limited number of mines around that do it. There can be all sorts of environmental problems in extracting it. And another, there's an economic issue hanging over all of this in that China dominates much of the processing technology that turns the lithium into the type of materials which are used by battery makers. And so as a result, the lithium price has shot up. And so it's an expensive material that can be hard to get hold of and difficult to process. So we need new ideas, I guess, to improve the capacity of these batteries or even come up with new technologies for the batteries of the future because we're going to need more of them. So talk me through what you think the most promising ways are to get through this problematic knot. Well, you need something to produce ions, which are the atomic elements that shuttle back and forwards in a rechargeable battery in order to store and then extract the power within them. And there's sort of two ways you can do that. One is you can tinker with the current technology, i.e. with the lithium ion properties to try and make super batteries. And there's various ways that's going on. And the other is to say, well, instead of using lithium ions, we'll get the ions from somewhere else and we use a cheaper and more common metal. And one of those is sodium. So let's talk about those two ideas separately then. The first of those is to tinker with the technology itself of lithium ion batteries. And you call them super batteries. What are super batteries and how do they work? A super battery is basically a lithium ion battery on steroids. It can store a lot more power and it can deliver that power faster. And the hope is do so much more safely. I think we need to get into a little bit of chemistry here to understand how a lithium ion battery works. Now what happens is there's three major components in a lithium ion battery. There's a cathode and there's the anode and they're either side. Both of those are electrodes. And in the middle is a substance through which the ions of lithium can migrate backwards and forwards. Now that substance is an electrolyte and currently it's a liquid one in most batteries. More of a gel than a liquid but it's in a liquid state. So what happens is when you charge up a traditional lithium ion battery, the ions, which are atomic particles, migrate from the cathode through the electrolyte and take up residence in the anode where they sit there. Now at the same time the electrons that are created by the charge current also go around to the anode but they can't get through the electrolyte because there's a porous separator there that prevents them traveling that way. So they get there through the external charging circuit where they join the ions again at the anode. Now when the battery is discharged those ions migrate back through the electrolyte to the cathode and the electrons again return to the cathode but this time by the external circuit where they'll go through some device such as an electric motor or a light bulb thus powering it. Okay so then you've got this battery with the anode, the cathode and the gel separator. That's a typical lithium ion battery but also it's because this is liquid that it can sometimes overheat and catch fire and things and that's what you want to try and improve with the idea of the super battery. So tell us about that. One of the ways you can produce a super battery is to replace that liquid electrolyte with a solid one. Now that has a number of attractions and particularly for battery makers it reduces the risk of fire as the solid electrolyte is less likely to overheat and burn and cause difficult chemical reactions which can cause battery fires. Now the problem about using a solid electrolyte is that a liquid is very good at coating and covering all the little particles, the active chemicals that are used on the cathode because you know you drop something in a bowl of water and the water flows all around it but a solid thing of course only contacts sort of part of the particles so making a good connection is difficult and that's been a very tricky thing to achieve but what's happening now is there's been a number of breakthroughs that people are finding ways to actually make these solid state lithium ion batteries and give them a good long operating life and beginning to see a way of doing that in scale. So if you replace the electrolyte with something solid and you can make the contacts between that and the cathode work you've got a safer battery at least and does it potentially have more charge as well? Well by making a solid state battery you're making one that's much smaller than the ones we have at the moment and that means it has a much higher energy density you can pack a lot more power inside it so as a consequence of that you can power things for longer you can go further. Toyota claims that it's found a way of producing these batteries with a range of around 1200 kilometres at 746 miles. Now that's about twice what many existing EVs can do and also that battery can be recharged in around 10 minutes. It's a much smaller battery and it's a much lighter battery so it starts to open up more possibilities not just in electric cars but also in electric aircraft so we're seeing an emergence of flying taxis these are electrically powered and they rely on lithium ion batteries so better super batteries will mean flying taxis will fly further and be able to carry more people. We've talked about capacity and charging and all of that what about the actual metals involved in lithium ion batteries because it's not just lithium of course that you need for a lithium ion battery you need nickel, cobalt these are other expensive materials which are causing you know geopolitical tensions around the world as well. What kinds of ways are there to try and reduce the use of those in future lithium ion batteries? Well you can tinker with the chemistry of the cathodes which usually contain different mixtures of material the most typical one is a combination of nickel, manganese and cobalt and these are called NMC batteries. They're highly effective but nickel, manganese, cobalt they're not easily got materials and cobalt in particular has some very serious problems with the way that it's mined in certain places using child labor and indeed many battery manufacturers are trying to reduce the amount of cobalt in their batteries and eliminate it altogether. But there's another sort of blend if you like of cathode materials coming along and that's lithium ion phosphate that avoids nickel and cobalt and these are becoming quite popular because obviously they're cheaper to make because you've taken the nickel and the cobalt on. They're a particular Chinese speciality but they do though have a lower storage capacity than the other type so they tend to be used in vehicles that perhaps don't require such a high level of performance like a smaller city car. Okay well we've talked about the next generations of lithium ion batteries and no doubt those will come along over the next decade and we're definitely going to see improvements in all of that with solid state lithium batteries but what about replacing lithium altogether because lithium itself is not that easy to get hold of. I mean there are mines and there will be more but we talked at the beginning about sodium as a potential replacement so talk to me about that. What's a sodium battery and what problems does it get around that lithium has right now? Well a sodium battery would work pretty much the same as a lithium ion battery does except that the source of the ions is sodium instead of lithium. The beauty of sodium is it is abundant and it's cheap but it's not quite the same as lithium because lithium is the lightest metal of all. Sodium is a bit further, there's next one down in the periodic table so that means its ions are a bit bigger and a bit heavier so being a bit bigger and heavier you would need a bigger and heavier battery to be able to match a lithium ion one but it is cheap so it's a case of what is the cost advantage and the operating abilities of a sodium battery. Now for many uses such as storing energy on the grid or if you had a house and you wanted to sort of store some of your solar electricity but in the sun's shining you could have a battery doing that where weight is less of a problem and it can charge up more slowly which is more suitable for a sodium battery. And also there are transport uses as well, I mean ships are already heavy, trains are already heavy, lorries are already heavy and in some cases a sodium battery may be useful in that particularly if the price is right. There is a use there in cars perhaps not quite so much, you might find it's used for some cheaper shorter range vehicles but no doubt it will find a place. So sodium ion batteries can be a replacement for lithium ion because they are very similar chemically speaking but obviously it's heavier and also I believe that for a sodium battery you don't need cobalt and nickel which is another advantage right? I think you can avoid them, yeah, yeah, I mean you can make them without some of these expensive materials so it would be quite a good way to go. So the technology sounds great and it sounds like there are plenty of use cases if not things like mobile phones and laptops at least plenty of other things in terms of grid storage or big buses and lorries or even home storage so is that going to be the magic solution for the batteries of the future then? Are we going to be awash with sodium batteries in the future? What's the sort of time scale for that? I think we'll see, they're a little bit behind advanced lithium ion batteries and the super lithium ion batteries in terms of development. The other issue that yet to be addressed is the infamous manufacturing one. The cost of a gigafactory that makes batteries is going to be the same for a sodium battery as it is for a lithium ion battery so some of the material costs might be cheaper but that might mean they don't end up being that much cheaper. Another thing you've got to look at is that the battery gigafactories are increasingly looking at what you might call a circular economy and this is once the batteries reach the end of the road they take them back again, break them up and recycle all those expensive materials back again so they can get the cobalt and the lithium back out of the battery, clean it and use it again. In one particular case there's a gigafactory which is thinking that it may be able to in the future produce 50% of the raw materials that it uses to make its battery from recycling old ones. That's interesting so there's probably not enough of a market for recycling batteries at the moment so that's quite a small thing but in the future it could be a significant fraction so you don't have to keep mining for new materials essentially. That's right there aren't that many lithium ion batteries around but there may be more than you think because they're coming from a number of areas. Some of these recycling operations are starting off recycling the lithium ion batteries or cell phones and computers because they can do that until the volumes from cars build up. There's also a sort of failure rate in factories so that some of the batteries that are made aren't good enough to be shipped out. They don't throw them away, they need to break them up and recycle the materials and have another go and those failure rates can be quite high particularly for new types of batteries and new designs. Do you know what Paul, this all is actually quite optimistic that there are so many battery technologies that could have such a massive impact to address that challenge which is that if the world is going to use more green energy and it needs to store it too then we need more batteries but it sounds like there could be multiple batteries for different solutions. Can you just conclude then by telling me what you think battery technology will look like in a decade's time? What kinds of batteries are we going to be using for different places? Well I think we'll see different batteries used for different applications so there won't be one battery that suits all. So you may see sodium batteries used to sort of store the electricity produced by the solar panels on your roof. You might go to recharge your electric car and find that the power is actually coming from what's called a flow battery which is a completely different type of battery in which the electrolyte is pumped out, recharged and pumped back in again and your electric car indeed may have any sort of battery. So a little bit like if we went to buy a car today we're offered a range of engines. We can have a small four cylinder or even a three cylinder turbocharged one for a little car you're going to run around town or you could get a sort of slightly bigger engine if you want to go further or if you're really into it getting a really beefy V8 and go for it. Well I think you'll get the same thing offered with an electric car. You could start off with a sodium battery for a little city run around or a lithium ion one if you make longer journeys and need to recharge en route or you could go for you know one of these expensive new solid state batteries which we'll start to see coming out around the 2030s to whack that in your high performance sports car and belt down to the south of France without recharging. And who knows what other technologies might be available within 10 years time. Indeed and there may be other things. All right Paul thank you very much for all of that. Before I let you go though we're going to be doing an episode of Babbage Soon on artificial intelligence and we're asking listeners whether they've got any questions they're desperate to hear answered on the show. So I'd ask you as well Paul what would you like to know from the world's leading AI experts if you had them in a room in front of you what would you ask? I'd like to know when AI will stop lying about when it's going to stop lying about things. Do you mean do you mean hallucinations or do you mean something else? I mean hallucinations yeah. Okay so as they euphemistically call them hallucinations it's just lies isn't it? Yeah exactly. Now for anyone listening you can also send us your questions on AI to podcasts at economist.com and make sure you put Babbage in the subject line. Of course if you want to hear an answer to your question you'll need to be part of the Economist Podcast Plus community so that you can listen to our future AI coverage. Paul thank you very much for your time. That's a pleasure. You can read more about sodium ion batteries on the Economist app. You can also scroll back to Paul's recent piece on super batteries. That one explains the future of solid state lithium ion batteries for electric cars. Find links to both those pieces in the show notes. Before we continue with the show a reminder that Economist Podcast Plus our new subscriber service is here. If you haven't yet signed up there's still time. The half price offer has been extended to the end of October. If you listen on Apple podcasts or Spotify you'll need to link your Economist subscription to your podcast app to unlock all of our shows. Don't worry it's really easy. We've published an extra mini episode alongside our regular episode this week which is a short welcome to the world of Economist Podcast Plus. This episode is locked. Click on it and then enter your Economist subscription details when prompted and then you'll be able to link your account. Once you've done that you're all set. You only need to do this once and all of our shows will be unlocked. You'll be free to follow any or all of our award winning Economist podcasts. So sit back and enjoy. If you don't use Apple or Spotify go to the FAQ page in the show notes to learn how to access subscriber only episodes on your preferred podcast app. If you're worried you're going to forget any of this then look out for an email which covers everything I've just mentioned. There's also a helpful video to walk you through it all. You can find all of that in the show notes as well. To keep listening without any interruptions you'll want to go through the linking process before Saturday the 28th of October when we'll publish our first episode of The Weekend Intelligence. I'm particularly excited about this first episode as it's all about how to live on the moon. It's a really beautiful story told by my colleague Jessica Camille Aguirre. After a day of driving around the moon's surface scouting and collecting samples, He and Young would get back to their little lunar landing module. They would reconstitute some food with cold water. Then they would string up their hammocks inside the tiny cabin which was full of knobs and levers. It had a tiny porthole they could look through and they pulled the shades over it to sleep. Duke told me it wasn't much like camping. Instead he had the feeling that the landing module was safe, a refuge where he could finally take his suit off. And even though his sleep improved, he never got over the thrill of being on the moon. I'll never forget that feeling of standing on the moon. You could look out at the horizon and the horizon was very sharp. So you could look up into the sky and it was just jet black. You could feel that you were so vivid you could feel like you could reach out and touch it. Sometimes it can seem that way from Earth too. You'll need to have your account set up to listen to that as well as next week's episode of Babbage. But remember there's still time to get access to all the shows on our award-winning network for half price. Just two dollars, pounds or euros a month. Google Economist podcasts to sign up. Coming up it's predicted that there currently aren't anything like enough metals available for the batteries the world needs. We'll explain what to do about that next. Ryan Reynolds here from Mint Mobile. With the price of just about everything going up during inflation we thought we'd bring our prices down. So to help us we brought in a reverse auctioneer which is apparently a thing. Mint Mobile Unlimited Premium Wireless. I bet you get 30, 30, 30, 20, 20, 20, 20, 20, 20, 15, 15, 15, 15, just 15 bucks a month. Give it a try at MintMobile.com slash switch. New activation and upfront payment for three month plan required. Taxes and fees extra. Additional restrictions apply. See MintMobile.com for full terms. By 2050 the green energy transition will mean the world needs 15 times today's wind power, 25 times more solar power, a tripling of the size of the electrical grid and a 60 fold increase in the fleet of electric vehicles. That means a lot of new batteries and with that a lot of so-called green metals. For the green metals alone what's really impressive is the rate of growth that we need to have even by 2030 actually. Mathieu Favasse is the Economist's finance correspondent. He's been investigating the challenge of how the metals needed for batteries can be sourced. So for copper and nickel, so copper is used across all the green technologies from turbines to electric cars, solar panels, but there's quite a lot of it in electric cars. Nickel is used in the batteries. Demand could rise by 50 to 70 percent by 2030. For cobalt also battery metal that's 150 percent at the same rate of increase for neodymium which is a rare earth which is used in engines. And then for graphite and lithium it could be six to seven fold. So we're starting for a small base but these are still quite striking rates of increase. Okay so we can see lithium and graphite six to seven fold. That's a massive increase in the requirement for those things. Where do the metals you've mentioned typically come from and where do we expect them to come from in these increasing terms? So where they are today and where we expect them to come from is actually quite similar. They come from places which are typically quite hard to mine or they're hard for investors and big mining companies to invest in or operate in. So for cobalt for example, the vast majority of it comes from the Democratic Republic of Congo which has a lot of political security and corruption challenges. For lithium 60 percent of known resources are in Latin America. But there's been recently protests. There's been a lot of political turmoil that could make it harder to mine there. For nickel it's a lot from Indonesia through a process that is extremely polluting and quite a few of them also come from China which perhaps the West wants to rely less on in the future. So everything you've talked about, every sort of source of minerals and metals has a geopolitical context that is not necessarily favorable to this transition. Which makes me think will we actually be able to dig up as many metals as we need to make the batteries by the targets that the world has set itself? So if we look at it in a face value today, the numbers are daunting and we're not going to hit the target. And you could make the case that the lack of materials, the lack of green metals could be what limits the transition if it's not the lack of political will. But this is only if you focus on supply. There's a lot of variables involved in this equation and also there's a lot of shifting in between technologies that can happen in particular when it comes to electric car batteries. So the end gap between supply and demand will be determined also by what happens with demand. Perhaps different ways to use the metals in other applications that are not green. There's a lot of moving parts which I think is often missed in the analysis that a lot of committees experts are making. They focus on supply but the demand side of the equation is much harder to figure out. What are the metals that you expect will be most problematic in terms of batteries? Yeah, I think cobalt to start with perhaps the least problematic. It looked like the biggest problem a few years ago but now it's much more ubiquitous and that's partly because it's the byproduct of the mining of other metals. So there's more being found basically, is that what it is? Yeah, more has been found and more is being produced as we produce other metals. For example, quite a few is produced in Indonesia now because Indonesia produces a lot of nickel and it's a byproduct of nickel. We could have a problem with nickel and not so much because there's not enough nickel around but because there's not enough of the right quality. We basically rely on Indonesia to find processes to upgrade its own nickel to the quality we need and even then it's likely that the processes will be very polluting. So that's a problem. Lithium look like it could be a problem because it's used across most of the battery technologies so the switching there can make less of a difference but there's hope because we are learning to use less lithium in every type of battery and also there's not really a scarcity of lithium around. There's actually quite a lot in the ground. So providing the price is high enough, we'll probably go to get it. It's also faster to create new lithium mines which are less complex, you go less deep than for other types of metals which leaves us with copper which I think is the most problematic one. First because as I said before, it's one that's used across a number of technologies, not just EVs. It's one that's been used for a long time in other industrial processes and the big mines that we have today in Peru and Chile are quite old. So the more we dig them, the less copper we recover every time. So we have to find new mines but we don't know where they are yet and also it will take 10 to 15 years to build them. So I think copper is the big bottleneck. So it sounds like the way to solve these problems is to open up more mines, at least at the first blush. We need more mines, more searches for sources of these metals. But I guess it's a real tension between that and the stated aims of all this which is to keep the environment somehow pristine. Now of course we will have to do some mining but what other methods might there be to try and solve some of the challenges of the metals you've talked about? Paul talked earlier about recycling. How much role do you think that's going to play versus new mines? So let's go through a few of the levers you can pull to try and get more metal or need less of them. So recycling I think eventually will be part of the solution, a big part of it, by maybe 2040, 2045. It's not that we don't have the capacity to do that today, even though the industry is still quite small and fragmented. So we need to invest in that. But it's more that we don't have the primary material in the first place because we don't have that many EVs on the road. Yeah, the market for recycling is not that big yet. Yeah, exactly. All the EVs that you want to recycle are not there yet. So that limits the potential for it. New mines are the solution probably in the long run. But as we said, they take a very long time to build and they take longer than before. So you know, it used to take maybe seven years. Now it's like 15, 17 years for copper because of all the permits that you need to get on top of the investment that you need to find, the searches that you need to do. So if you want to relieve bottlenecks by 2030, that's not going to help you much. So in the interim, you can do two things. The first is you can use new technological solutions to do more with the mines you already have. One such process is called tail itching, where you introduce a solution in the waste of copper mines and you can recover some copper from it, even though the concentration is really low. So more efficient mining, essentially. Exactly. More efficient mining. There's also, you know, AI is being tested to try and find new deposits in places where we haven't thought of looking, which is also promising. But all these solutions, you know, they could provide some quick wins, but they have some drawbacks. Your tail itching is a bit unproven, not really tested at scale, and AI also, you know, untested. So I think the biggest lever is really on demand. It's switching between technologies, but it's also thinking about how you could use some of the metal that is being used elsewhere for non-green applications, that you could basically cannibalize it to use it for your electric cars. That applies especially to copper, but for the other ones, perhaps a little as well. It seems to be a sophisticated problem then, Mathieu. I mean, how do you think about it? Are you optimistic that these tools that we have at play, these levers that you're talking about, that these could actually help us meet the targets we have, or is it still uncertain in your mind? I'd be much more optimistic than I think most market analysts are, because there's been a lot of big numbers banded around in terms of the deficits that you can expect, so sort of a supply wall that we're going to hit by 2030. But if you look at all these levers together, there's really potential to fill a lot of that gap. So to me, the deficits will end up being much smaller than we think, in part because carmakers are very price sensitive, they're very high risk of shortages, and they innovate quite a lot. So we've already seen very big bottlenecks being solved like Cobalt. We've seen the content of Cobalt in some batteries diminish rapidly, and it's quite likely that they will find new solutions to solve these bottlenecks. Mathieu, thank you very much. You're welcome, Alok. When you look at the future landscape for batteries, you're reminded how complicated the green energy transition will actually be. Looking out what the future looks like is not only reliant on what the best technology is or which metals might be most available. It's also about supply chains, government incentives and business plans. All of these will determine the market for which batteries can be implemented at scale. Anjani Trevadi is our global business correspondent, and she's based in Dubai. Anjani, can you just help us understand what we need to think about when looking at the future of batteries? I think, first and foremost, batteries are a means to an end. And I think that end is basically electrification, electric vehicles, and being able to use renewable energy effectively. And I think once we come to terms with that, then we can think a little more about how do we now find commercially viable batteries that we can use that boost adoption and that ultimately get us to where we need to be, which is all these targets that have been set for companies, for governments, for countries. And I think that means that what's happening now, and we're seeing this, is that companies are going full circle, battery makers specifically, from having these big ambitious plans for how chemistry would evolve and how battery prices would come down sharply. And then everyone would want to drive an electric vehicle because it would make so much more sense than a gas guzzler. But I think what's happened is that battery prices have not come down. One chemistry has not emerged as the one that's going to take you the furthest. And so there's a kind of return to reality where people are now realizing that maybe what we need is a safe battery, a battery that takes us just as far as we need to go, no further than that. And that's why the lithium iron phosphate battery has become the most popular and has gained so much market share. And it's an older technology. So I think one of the factors we now need to consider is how do we make this commercially viable and how do we make this more realistic and move away from fantastical ideas that are still five to 10 years away if we are to drive meaningful adoption of electric vehicles, meaningful adoption of renewable energy. Okay, so the idea of new technologies is there in the mix. But I suppose what you're saying is that people want some stability, people want some predictability. And so that's why they're going back to some of these older ideas like lithium phosphate batteries. But I'm curious, what do you make of the sort of supply shortages in minerals and metals and things that Mateo was talking to us about earlier in the show? If you project into the next few decades and we make, whether it's older style batteries or new ones, there's going to be crunches of all sorts of materials. Does that have an impact on the kinds of directions that people go in in terms of the batteries they make? To some extent, yes, it will have an impact, but I think where we are on technology right now, which is lithium iron phosphate with materials that are fairly abundantly available and companies like China's Contemporary Amperex, which is the world's largest battery maker, are now trying to find ways to incorporate minerals that are also widely available like manganese and get rid of things like cobalt, which are used in certain battery chemistries. And so the reality is it's going to be a patchwork of batteries for different uses. Whether it's sodium ion for smaller vehicles and backup storage, or if it's lithium iron for bigger vehicles and vanadium for large backups, industrial storage, I think that will help how and where certain metals are used. In addition, and we can't forget this, it's becoming a big thing in China, is recycling, which stands to play a big role in the next 10 years as batteries that are being produced now, which have a five to eight year life, come to the end of their life. And as those go into the secondary market and are recycled, they could help bridge some of the supply gap on lithium, for instance, if miners don't, you know, ramp up mining or find more economical ways to bring more battery grade lithium. Okay, so that's interesting. And it's an echo of what Paul already told us as well, which is that there'll be batteries for different purposes in different places, whether it's the home or cars or wherever else buses, etc. And he also mentioned recycling, but how do you incentivize people to actually do any of this stuff? Is that the key for something like recycling? People nowadays want to throw everything away and recycling is an important part of this. Where does that fit into the sort of future battery landscape? So recycling, I think people have to be incentivized with costs, right, and bringing the cost down because ultimately, that's what the biggest hurdle is, right? If the moment we can get battery costs down, EVs costs come down and people start adopting it, because then you're presenting them with an economical option. With recycling is the same thing. Right now, the cost and the hassle of recycling is very high. So what's happened in China, for instance, is that the government has forced in a way and incentivized companies to recycle batteries and they've put the burden on these companies to say, look, you have to go set up collection points in a secondary market for when your batteries are towards the end of their life. And so that's happened. Now there's over 10,000 collection points. And so by the end of the decade, the kind of end of life battery component will really be, I think, enough to address the supply issue. So they've set really specific technical guidelines in China around where to recycle, how to recycle and taking into consideration all the environmental and health hazards if EV batteries are not disposed properly. And they found that lithium-ion battery recycling is actually quite profitable. When there's enough quantity, then those also become profitable businesses. And when you can get to that point, then it makes sense. Yeah, and I suppose if one country can show that there's a business case for it, then it'll quickly spread and the technology will move forward more rapidly. I guess the nature, though, of supply chains for things like the batteries for electric vehicles, there's global competition for this. And you've got geopolitics playing into it. America's put huge restrictions on products coming from China. Do you think that any of that is putting a pressure on progress with the technology and the uptake of batteries? It's affecting the ability to scale the right technologies. And that in itself is a huge problem. In large part because of the geopolitical restrictions and the industrial policies that have been put in place, we've now found that there's an America-Korea belt because all the Korean battery makers like Samsung SDI, SKON, LG Energy are all building factories in the US because they are not Chinese. And Europe, which was initially a lot more open, has allowed direct supply from Chinese makers, has also allowed electric vehicles to be imported in a big way. So Europe has actually gone a lot further. What's happened as a function of that is that Europe has ended up with a battery chemistry like lithium iron phosphate as a kind of main battery chemistry. The US has no capacity for lithium iron phosphate, which is actually the more realistic technology. They're now going to be lagging and they've ended up with a chemistry that is a lot more expensive and a lot harder to make. What could have happened if these policies were not so divisive was that we could have ended up with a battery chemistry that eventually becomes a standard because so many people are using it or so many companies are using it. And then that gets commoditized. And once a battery or any such product gets commoditized, prices come down and then incremental innovation happens after that. So I think because of these policies, we've kind of been set back a bit, if not quite a bit. And, you know, I think the right way right now is to come up with agreements and arrangements that help scale mature technology. You're a self-confessed battery nerd, Anjane. So I'd like to know, in the next decade or so, what are you looking out for in terms of the interesting stories and the things that are worth tracking when it comes to watching the kinds of battery technologies that are taking off? You know, I think one of the things that's been fascinating to watch, especially over the last five years, I'd say, is that we're starting to see more realistic innovation. And that isn't as jazzy as a brand new chemistry, which is going to, you know, be in every luxury electric vehicle. But it's a focus on different ways to manufacture batteries and a focus on the different architectures of batteries and, you know, could we do something else with certain parts of the batteries? Could we pack them together so that the energy density and energy flow is more effective? And I think those kinds of innovations will have huge returns going forward and more so than finding some new battery chemistry. So I think that's something to watch out for. You know, we're starting to see that in the lithium iron phosphate side. Now they're looking at lithium iron manganese phosphate, which has already shown to be quite promising. And so a lot of the manufacturing innovation to me is quite fascinating. And I think that focus has not been there for the last 20 years or so, which is why we're still behind on battery storage. Okay, Anjani, that's really good to have somebody who knows what is actually possible and giving us a good dose of reality. So thank you very much for taking me through all of that. Thanks, Salok. Our thanks to the economist Paul Markili, Mathieu Favasse and Anjani Trivedi. And thank you for listening to Babbage. Don't forget that as a valued member of the Economist Podcast Plus community, you'll receive the first episode of The Weekend Intelligence in your feed this Saturday, all about living on the moon. Make sure you use the most of your subscription and give that a listen. Babbage is produced by Jason Hoskin and Kanaal Patel with mixing and sound design by James Stickland. The executive producer is Marguerite Howell. I'm Alok Jha and in London, this is The Economist. Did you ever imagine what it would look like to live on the moon? How would you breathe? Where would you sleep? Would you want a room with a view of Earth or the celestial heavens? Imagine sitting on a crater that is 20 kilometers wide and you look down into the crater, you see nothing but darkness. Okay. And above you, you see nothing but darkness and the stars. Science fiction is full of stories of people living out among the stars. But science fact is fast catching up. I'm Jessica Camille Aguirre and for The Economist, I've been talking to people about a blueprint for a moon habitat. If I would compare it to something, I would compare it to some of the Mediterranean architecture you know. But then, of course, the space is a continuous curve and it has this kind of very tall, almost gothic arch. What I discovered was a vision for the evolution of humanity. You've gone beyond what you thought you were capable of. You've reached the outer edge of humans footprint on the universe. You're sort of staring out beyond and yet weirdly you're at the lowest rung of a ladder that generations of people are going to climb as they leave Earth. I don't know, you mark a place in history. That's The Week in Intelligence, coming this Saturday from The Economist."}, "podcast_summary": "The green energy transition is driving the need for more batteries, but there are challenges to overcome. Lithium-ion batteries, the current industry standard, have limitations such as the risk of fire, limited capacity, and the reliance on rare metals. To address these issues, researchers are exploring new technologies, including solid-state lithium-ion batteries and sodium-ion batteries. Solid-state batteries eliminate the risk of fire and have higher energy density, while sodium-ion batteries use cheaper and more abundant materials. Furthermore, recycling batteries offers a potential solution to the scarcity of metals like lithium and cobalt. However, the transition to new battery technologies is complicated by factors such as geopolitical tensions, supply chain issues, and the need for incentives to encourage recycling. Companies and governments need to work together to find commercially viable and sustainable solutions. Overall, a combination of different battery technologies and strategies will be required to meet the growing demand for energy storage in the future.", "podcast_guest": "Not Available", "podcast_highlights": "- Ryan Reynolds announces that Mint Mobile is cutting the price of Mint Unlimited from $30 a month to just $15 a month, due to not hating customers (0:00-0:33)\n\n- A quick announcement about Economist Podcast Plus, a new subscriber service (0:34-1:54)\n\n- The world is transitioning to renewable energy, and increasing battery storage capacity is essential for this transition (1:55-2:42)\n\n- Lithium-ion batteries revolutionized the industry with their lighter weight and higher efficiency, enabling the electric car revolution (2:43-5:57)\n\n- While lithium-ion batteries have their advantages, they are not perfect and face limitations such as safety concerns, limited capacity, and reliance on rare metals like lithium and cobalt (5:58-9:10)\n\n- Research is focused on developing \"super batteries\" that can store more power, deliver power faster, and address safety concerns through the use of solid state electrolytes (9:11-16:35)\n\n- Alternative battery technologies, such as sodium-ion batteries, are being explored as replacements for lithium-ion batteries, offering advantages like lower cost and availability of abundant metals (16:36-18:38)\n\n- The demand for metals and minerals needed for batteries is expected to increase significantly, posing challenges in terms of supply and environmental impact (18:39-22:08)\n\n- Addressing the metals shortage may involve recycling batteries, finding new mining sources, and shifting demand through technological innovation and more efficient use of metals (22:09-26:41)\n\n- Government policies and geopolitical factors can impact the development and adoption of battery technologies, hindering progress or promoting certain types of batteries (26:42-29:20)\n\n- Commercial viability and cost reduction will be key factors in driving the adoption of battery technologies, as well as incentivizing recycling and sustainable practices (29:21-31:10)\n\n- Innovation in battery manufacturing processes and architectures could have significant impacts on battery performance and cost (31:11-34:12)\n\n- The focus should be on realistic innovation and finding commercially viable solutions to drive adoption of electric vehicles and renewable energy (34:13-36:00)", "podcast_hashtags": "#batteries #renewableenergy #energytransition #metalsupply #recycling"}